#+AUTHOR: Matt Shum
#+TITLE: dotemacs

Inspired by the maintainer of =emacs=, John Wiegley.

*** Choose Theme
Dracula theme.
#+BEGIN_SRC emacs-lisp
  ;;(load-theme 'dracula t)
#+END_SRC
Modus theme. /Note/: we are using ~modus-themes~ 3.0.0. The one that is
preinstalled with =emacs=.
#+BEGIN_SRC emacs-lisp
  ;; Configure the Modus Themes' appearance
  (setq modus-themes-mode-line '(modus-themes-tabs-accented borderless)
        modus-themes-bold-constructs t
        modus-themes-italic-constructs t
        modus-themes-fringes 'subtle
        modus-themes-tabs-accented t
        modus-themes-paren-match '(bold intense)
        modus-themes-prompts '(bold intense)
        modus-themes-completions '((matches . (extrabold underline))
                                   (selection . (semibold italic)))
        modus-themes-org-blocks 'tinted-background
        modus-themes-scale-headings t
        modus-themes-region '(bg-only)
        modus-themes-headings
        '((1 . (rainbow overline background 1.4))
          (2 . (rainbow background 1.3))
          (3 . (rainbow bold 1.2))
          (t . (semilight 1.1))))
  ;; 
  (load-theme 'modus-vivendi t)
#+END_SRC

#+RESULTS:
: t
Spacious Padding.
#+BEGIN_SRC emacs-lisp
  (use-package spacious-padding
    :ensure t
    :hook (after-init . spacious-padding-mode))
#+END_SRC

#+RESULTS:
: #s(hash-table size 65 test eql rehash-size 1.5 rehash-threshold 0.8125 data (:use-package (26113 35172 677614 701000) :init (26113 35172 677588 952000) :init-secs (0 0 56 748000) :use-package-secs (0 10 117723 880000)))

Highlights.
#+BEGIN_SRC emacs-lisp
  ;;; highlight indent
  (use-package highlight-indent-guides
    :ensure t
    :config
    (set-face-foreground 'highlight-indent-guides-character-face "dimgray")
    (setq highlight-indent-guides-method 'character))
#+END_SRC
